nandojve/hal_gigadevice/include/dt-bindings/pinctrl/gd32e507z(c-e)xx-pinctrl.h
/* CK_OUT */
#define CK_OUT_PA8 \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, NORMP)

/* CTC_SYNC */
#define CTC_SYNC_PA8_NORMP \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, CTC_NORMP)
#define CTC_SYNC_PD15_PRMP1 \
	GD32_PINMUX_AFIO('D', 15, ALTERNATE, CTC_PRMP1)
#define CTC_SYNC_PF0_PRMP2 \
	GD32_PINMUX_AFIO('F', 0, ALTERNATE, CTC_PRMP2)
#define CTC_SYNC_PF0_FRMP \
	GD32_PINMUX_AFIO('F', 0, ALTERNATE, CTC_FRMP)

/* DAC_OUT0 */
#define DAC_OUT0_PA4 \
	GD32_PINMUX_AFIO('A', 4, ANALOG, NORMP)

/* DAC_OUT1 */
#define DAC_OUT1_PA5 \
	GD32_PINMUX_AFIO('A', 5, ANALOG, NORMP)

/* EXMC_A0 */
#define EXMC_A0_PF0 \
	GD32_PINMUX_AFIO('F', 0, ALTERNATE, NORMP)

/* EXMC_A1 */
#define EXMC_A1_PF1 \
	GD32_PINMUX_AFIO('F', 1, ALTERNATE, NORMP)

/* EXMC_A10 */
#define EXMC_A10_PG0 \
	GD32_PINMUX_AFIO('G', 0, ALTERNATE, NORMP)

/* EXMC_A11 */
#define EXMC_A11_PG1 \
	GD32_PINMUX_AFIO('G', 1, ALTERNATE, NORMP)

/* EXMC_A12 */
#define EXMC_A12_PG2 \
	GD32_PINMUX_AFIO('G', 2, ALTERNATE, NORMP)

/* EXMC_A13 */
#define EXMC_A13_PG3 \
	GD32_PINMUX_AFIO('G', 3, ALTERNATE, NORMP)

/* EXMC_A14 */
#define EXMC_A14_PG4 \
	GD32_PINMUX_AFIO('G', 4, ALTERNATE, NORMP)

/* EXMC_A15 */
#define EXMC_A15_PG5 \
	GD32_PINMUX_AFIO('G', 5, ALTERNATE, NORMP)

/* EXMC_A16 */
#define EXMC_A16_PD11 \
	GD32_PINMUX_AFIO('D', 11, ALTERNATE, NORMP)

/* EXMC_A17 */
#define EXMC_A17_PD12 \
	GD32_PINMUX_AFIO('D', 12, ALTERNATE, NORMP)

/* EXMC_A18 */
#define EXMC_A18_PD13 \
	GD32_PINMUX_AFIO('D', 13, ALTERNATE, NORMP)

/* EXMC_A19 */
#define EXMC_A19_PE3 \
	GD32_PINMUX_AFIO('E', 3, ALTERNATE, NORMP)

/* EXMC_A2 */
#define EXMC_A2_PF2 \
	GD32_PINMUX_AFIO('F', 2, ALTERNATE, NORMP)

/* EXMC_A20 */
#define EXMC_A20_PE4 \
	GD32_PINMUX_AFIO('E', 4, ALTERNATE, NORMP)

/* EXMC_A21 */
#define EXMC_A21_PE5 \
	GD32_PINMUX_AFIO('E', 5, ALTERNATE, NORMP)

/* EXMC_A22 */
#define EXMC_A22_PE6 \
	GD32_PINMUX_AFIO('E', 6, ALTERNATE, NORMP)

/* EXMC_A23 */
#define EXMC_A23_PE2 \
	GD32_PINMUX_AFIO('E', 2, ALTERNATE, NORMP)

/* EXMC_A24 */
#define EXMC_A24_PG13 \
	GD32_PINMUX_AFIO('G', 13, ALTERNATE, NORMP)

/* EXMC_A25 */
#define EXMC_A25_PG14 \
	GD32_PINMUX_AFIO('G', 14, ALTERNATE, NORMP)

/* EXMC_A3 */
#define EXMC_A3_PF3 \
	GD32_PINMUX_AFIO('F', 3, ALTERNATE, NORMP)

/* EXMC_A4 */
#define EXMC_A4_PF4 \
	GD32_PINMUX_AFIO('F', 4, ALTERNATE, NORMP)

/* EXMC_A5 */
#define EXMC_A5_PF5 \
	GD32_PINMUX_AFIO('F', 5, ALTERNATE, NORMP)

/* EXMC_A6 */
#define EXMC_A6_PF12 \
	GD32_PINMUX_AFIO('F', 12, ALTERNATE, NORMP)

/* EXMC_A7 */
#define EXMC_A7_PF13 \
	GD32_PINMUX_AFIO('F', 13, ALTERNATE, NORMP)

/* EXMC_A8 */
#define EXMC_A8_PF14 \
	GD32_PINMUX_AFIO('F', 14, ALTERNATE, NORMP)

/* EXMC_A9 */
#define EXMC_A9_PF15 \
	GD32_PINMUX_AFIO('F', 15, ALTERNATE, NORMP)

/* EXMC_CD */
#define EXMC_CD_PF9 \
	GD32_PINMUX_AFIO('F', 9, GPIO_IN, NORMP)

/* EXMC_CLK */
#define EXMC_CLK_PD3 \
	GD32_PINMUX_AFIO('D', 3, ALTERNATE, NORMP)

/* EXMC_D0 */
#define EXMC_D0_PD14 \
	GD32_PINMUX_AFIO('D', 14, ALTERNATE, NORMP)

/* EXMC_D1 */
#define EXMC_D1_PD15 \
	GD32_PINMUX_AFIO('D', 15, ALTERNATE, NORMP)

/* EXMC_D10 */
#define EXMC_D10_PE13 \
	GD32_PINMUX_AFIO('E', 13, ALTERNATE, NORMP)

/* EXMC_D11 */
#define EXMC_D11_PE14 \
	GD32_PINMUX_AFIO('E', 14, ALTERNATE, NORMP)

/* EXMC_D12 */
#define EXMC_D12_PE15 \
	GD32_PINMUX_AFIO('E', 15, ALTERNATE, NORMP)

/* EXMC_D13 */
#define EXMC_D13_PD8 \
	GD32_PINMUX_AFIO('D', 8, ALTERNATE, NORMP)

/* EXMC_D14 */
#define EXMC_D14_PD9 \
	GD32_PINMUX_AFIO('D', 9, ALTERNATE, NORMP)

/* EXMC_D15 */
#define EXMC_D15_PD10 \
	GD32_PINMUX_AFIO('D', 10, ALTERNATE, NORMP)

/* EXMC_D2 */
#define EXMC_D2_PD0 \
	GD32_PINMUX_AFIO('D', 0, ALTERNATE, NORMP)

/* EXMC_D3 */
#define EXMC_D3_PD1 \
	GD32_PINMUX_AFIO('D', 1, ALTERNATE, NORMP)

/* EXMC_D4 */
#define EXMC_D4_PE7 \
	GD32_PINMUX_AFIO('E', 7, ALTERNATE, NORMP)

/* EXMC_D5 */
#define EXMC_D5_PE8 \
	GD32_PINMUX_AFIO('E', 8, ALTERNATE, NORMP)

/* EXMC_D6 */
#define EXMC_D6_PE9 \
	GD32_PINMUX_AFIO('E', 9, ALTERNATE, NORMP)

/* EXMC_D7 */
#define EXMC_D7_PE10 \
	GD32_PINMUX_AFIO('E', 10, ALTERNATE, NORMP)

/* EXMC_D8 */
#define EXMC_D8_PE11 \
	GD32_PINMUX_AFIO('E', 11, ALTERNATE, NORMP)

/* EXMC_D9 */
#define EXMC_D9_PE12 \
	GD32_PINMUX_AFIO('E', 12, ALTERNATE, NORMP)

/* EXMC_INT1 */
#define EXMC_INT1_PG6 \
	GD32_PINMUX_AFIO('G', 6, GPIO_IN, NORMP)

/* EXMC_INT2 */
#define EXMC_INT2_PG7 \
	GD32_PINMUX_AFIO('G', 7, GPIO_IN, NORMP)

/* EXMC_INTR */
#define EXMC_INTR_PF10 \
	GD32_PINMUX_AFIO('F', 10, GPIO_IN, NORMP)

/* EXMC_NADV */
#define EXMC_NADV_PB7 \
	GD32_PINMUX_AFIO('B', 7, ALTERNATE, NORMP)

/* EXMC_NBL0 */
#define EXMC_NBL0_PE0 \
	GD32_PINMUX_AFIO('E', 0, ALTERNATE, NORMP)

/* EXMC_NBL1 */
#define EXMC_NBL1_PE1 \
	GD32_PINMUX_AFIO('E', 1, ALTERNATE, NORMP)

/* EXMC_NCE1 */
#define EXMC_NCE1_PD7 \
	GD32_PINMUX_AFIO('D', 7, ALTERNATE, NORMP)

/* EXMC_NCE2 */
#define EXMC_NCE2_PG9 \
	GD32_PINMUX_AFIO('G', 9, ALTERNATE, NORMP)

/* EXMC_NCE3_0 */
#define EXMC_NCE3_0_PG10 \
	GD32_PINMUX_AFIO('G', 10, ALTERNATE, NORMP)

/* EXMC_NCE3_1 */
#define EXMC_NCE3_1_PG11 \
	GD32_PINMUX_AFIO('G', 11, ALTERNATE, NORMP)

/* EXMC_NE0 */
#define EXMC_NE0_PD7 \
	GD32_PINMUX_AFIO('D', 7, ALTERNATE, NORMP)

/* EXMC_NE1 */
#define EXMC_NE1_PG9 \
	GD32_PINMUX_AFIO('G', 9, ALTERNATE, NORMP)

/* EXMC_NE2 */
#define EXMC_NE2_PG10 \
	GD32_PINMUX_AFIO('G', 10, ALTERNATE, NORMP)

/* EXMC_NE3 */
#define EXMC_NE3_PG12 \
	GD32_PINMUX_AFIO('G', 12, ALTERNATE, NORMP)

/* EXMC_NIORD */
#define EXMC_NIORD_PF6 \
	GD32_PINMUX_AFIO('F', 6, ALTERNATE, NORMP)

/* EXMC_NIOS16 */
#define EXMC_NIOS16_PF11 \
	GD32_PINMUX_AFIO('F', 11, GPIO_IN, NORMP)

/* EXMC_NIOWR */
#define EXMC_NIOWR_PF8 \
	GD32_PINMUX_AFIO('F', 8, ALTERNATE, NORMP)

/* EXMC_NOE */
#define EXMC_NOE_PD4 \
	GD32_PINMUX_AFIO('D', 4, ALTERNATE, NORMP)

/* EXMC_NREG */
#define EXMC_NREG_PF7 \
	GD32_PINMUX_AFIO('F', 7, ALTERNATE, NORMP)

/* EXMC_NWAIT */
#define EXMC_NWAIT_PD6 \
	GD32_PINMUX_AFIO('D', 6, GPIO_IN, NORMP)

/* EXMC_NWE */
#define EXMC_NWE_PD5 \
	GD32_PINMUX_AFIO('D', 5, ALTERNATE, NORMP)

