nandojve/hal_gigadevice/include/dt-bindings/pinctrl/gd32e507z(c-e)xx-pinctrl.h
/* I2C0_SCL */
#define I2C0_SCL_PB6_NORMP \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, I2C0_NORMP)

/* I2C0_SDA */
#define I2C0_SDA_PB7_NORMP \
	GD32_PINMUX_AFIO('B', 7, ALTERNATE, I2C0_NORMP)

/* I2C0_SMBA */
#define I2C0_SMBA_PB5 \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, NORMP)

/* I2C0_TXFRAME */
#define I2C0_TXFRAME_PB4 \
	GD32_PINMUX_AFIO('B', 4, ALTERNATE, NORMP)

/* I2C2_SCL */
#define I2C2_SCL_PA8 \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, NORMP)
#define I2C2_SCL_PB5 \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, NORMP)

/* I2C2_SDA */
#define I2C2_SDA_PB4 \
	GD32_PINMUX_AFIO('B', 4, ALTERNATE, NORMP)

/* I2C2_SMBA */
#define I2C2_SMBA_PA9 \
	GD32_PINMUX_AFIO('A', 9, ALTERNATE, NORMP)

/* I2S2_ADD_SD */
#define I2S2_ADD_SD_PB4_INP \
	GD32_PINMUX_AFIO('B', 4, GPIO_IN, NORMP)
#define I2S2_ADD_SD_PB4_OUT \
	GD32_PINMUX_AFIO('B', 4, ALTERNATE, NORMP)

/* I2S2_CK */
#define I2S2_CK_PB3_INP_NORMP \
	GD32_PINMUX_AFIO('B', 3, GPIO_IN, I2S2_NORMP)
#define I2S2_CK_PB3_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, I2S2_NORMP)

/* I2S2_SD */
#define I2S2_SD_PB5_INP_NORMP \
	GD32_PINMUX_AFIO('B', 5, GPIO_IN, I2S2_NORMP)
#define I2S2_SD_PB5_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, I2S2_NORMP)

/* I2S2_WS */
#define I2S2_WS_PA15_INP_NORMP \
	GD32_PINMUX_AFIO('A', 15, GPIO_IN, I2S2_NORMP)
#define I2S2_WS_PA15_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, I2S2_NORMP)
#define I2S2_WS_PA4_INP_RMP \
	GD32_PINMUX_AFIO('A', 4, GPIO_IN, I2S2_RMP)
#define I2S2_WS_PA4_OUT_RMP \
	GD32_PINMUX_AFIO('A', 4, ALTERNATE, I2S2_RMP)

/* SHRTIMER_EXEV2 */
#define SHRTIMER_EXEV2_PB7 \
	GD32_PINMUX_AFIO('B', 7, GPIO_IN, NORMP)
#define SHRTIMER_EXEV2_PD5 \
	GD32_PINMUX_AFIO('D', 5, GPIO_IN, NORMP)

/* SHRTIMER_EXEV3 */
#define SHRTIMER_EXEV3_PB6 \
	GD32_PINMUX_AFIO('B', 6, GPIO_IN, NORMP)
#define SHRTIMER_EXEV3_PG11 \
	GD32_PINMUX_AFIO('G', 11, GPIO_IN, NORMP)

/* SHRTIMER_EXEV4 */
#define SHRTIMER_EXEV4_PG12 \
	GD32_PINMUX_AFIO('G', 12, GPIO_IN, NORMP)

/* SHRTIMER_EXEV5 */
#define SHRTIMER_EXEV5_PB5 \
	GD32_PINMUX_AFIO('B', 5, GPIO_IN, NORMP)

/* SHRTIMER_EXEV6 */
#define SHRTIMER_EXEV6_PB4 \
	GD32_PINMUX_AFIO('B', 4, GPIO_IN, NORMP)

/* SHRTIMER_EXEV8 */
#define SHRTIMER_EXEV8_PB3 \
	GD32_PINMUX_AFIO('B', 3, GPIO_IN, NORMP)

/* SHRTIMER_EXEV9 */
#define SHRTIMER_EXEV9_PG13 \
	GD32_PINMUX_AFIO('G', 13, GPIO_IN, NORMP)

/* SHRTIMER_FLT0 */
#define SHRTIMER_FLT0_PA12 \
	GD32_PINMUX_AFIO('A', 12, GPIO_IN, NORMP)

/* SHRTIMER_FLT1 */
#define SHRTIMER_FLT1_PA15 \
	GD32_PINMUX_AFIO('A', 15, GPIO_IN, NORMP)

/* SHRTIMER_FLT2 */
#define SHRTIMER_FLT2_PD4 \
	GD32_PINMUX_AFIO('D', 4, GPIO_IN, NORMP)

/* SHRTIMER_FLT4 */
#define SHRTIMER_FLT4_PG10 \
	GD32_PINMUX_AFIO('G', 10, GPIO_IN, NORMP)

/* SHRTIMER_SCIN */
#define SHRTIMER_SCIN_PB2 \
	GD32_PINMUX_AFIO('B', 2, GPIO_IN, NORMP)
#define SHRTIMER_SCIN_PB6 \
	GD32_PINMUX_AFIO('B', 6, GPIO_IN, NORMP)
#define SHRTIMER_SCIN_PE0 \
	GD32_PINMUX_AFIO('E', 0, GPIO_IN, NORMP)

/* SHRTIMER_SCOUT */
#define SHRTIMER_SCOUT_PB1 \
	GD32_PINMUX_AFIO('B', 1, GPIO_IN, NORMP)
#define SHRTIMER_SCOUT_PB3 \
	GD32_PINMUX_AFIO('B', 3, GPIO_IN, NORMP)
#define SHRTIMER_SCOUT_PE1 \
	GD32_PINMUX_AFIO('E', 1, GPIO_IN, NORMP)

/* SHRTIMER_ST0CH0 */
#define SHRTIMER_ST0CH0_PA8 \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, NORMP)

/* SHRTIMER_ST0CH1 */
#define SHRTIMER_ST0CH1_PA9 \
	GD32_PINMUX_AFIO('A', 9, ALTERNATE, NORMP)

/* SHRTIMER_ST1CH0 */
#define SHRTIMER_ST1CH0_PA10 \
	GD32_PINMUX_AFIO('A', 10, ALTERNATE, NORMP)

/* SHRTIMER_ST1CH1 */
#define SHRTIMER_ST1CH1_PA11 \
	GD32_PINMUX_AFIO('A', 11, ALTERNATE, NORMP)

/* SHRTIMER_ST4CH0 */
#define SHRTIMER_ST4CH0_PG6 \
	GD32_PINMUX_AFIO('G', 6, ALTERNATE, NORMP)

/* SHRTIMER_ST4CH1 */
#define SHRTIMER_ST4CH1_PG7 \
	GD32_PINMUX_AFIO('G', 7, ALTERNATE, NORMP)

/* SPI0_IO2 */
#define SPI0_IO2_PA2_NORMP \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, SPI0_NORMP)
#define SPI0_IO2_PB6_RMP \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, SPI0_RMP)

/* SPI0_IO3 */
#define SPI0_IO3_PA3_NORMP \
	GD32_PINMUX_AFIO('A', 3, ALTERNATE, SPI0_NORMP)
#define SPI0_IO3_PB7_RMP \
	GD32_PINMUX_AFIO('B', 7, ALTERNATE, SPI0_RMP)

/* SPI0_MISO */
#define SPI0_MISO_PA6_INP_NORMP \
	GD32_PINMUX_AFIO('A', 6, GPIO_IN, SPI0_NORMP)
#define SPI0_MISO_PA6_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 6, ALTERNATE, SPI0_NORMP)
#define SPI0_MISO_PB4_INP_RMP \
	GD32_PINMUX_AFIO('B', 4, GPIO_IN, SPI0_RMP)
#define SPI0_MISO_PB4_OUT_RMP \
	GD32_PINMUX_AFIO('B', 4, ALTERNATE, SPI0_RMP)

/* SPI0_MOSI */
#define SPI0_MOSI_PA7_INP_NORMP \
	GD32_PINMUX_AFIO('A', 7, GPIO_IN, SPI0_NORMP)
#define SPI0_MOSI_PA7_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 7, ALTERNATE, SPI0_NORMP)
#define SPI0_MOSI_PB5_INP_RMP \
	GD32_PINMUX_AFIO('B', 5, GPIO_IN, SPI0_RMP)
#define SPI0_MOSI_PB5_OUT_RMP \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, SPI0_RMP)

/* SPI0_NSS */
#define SPI0_NSS_PA4_INP_NORMP \
	GD32_PINMUX_AFIO('A', 4, GPIO_IN, SPI0_NORMP)
#define SPI0_NSS_PA4_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 4, ALTERNATE, SPI0_NORMP)
#define SPI0_NSS_PA15_INP_RMP \
	GD32_PINMUX_AFIO('A', 15, GPIO_IN, SPI0_RMP)
#define SPI0_NSS_PA15_OUT_RMP \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, SPI0_RMP)

/* SPI0_SCK */
#define SPI0_SCK_PA5_INP_NORMP \
	GD32_PINMUX_AFIO('A', 5, GPIO_IN, SPI0_NORMP)
#define SPI0_SCK_PA5_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 5, ALTERNATE, SPI0_NORMP)
#define SPI0_SCK_PB3_INP_RMP \
	GD32_PINMUX_AFIO('B', 3, GPIO_IN, SPI0_RMP)
#define SPI0_SCK_PB3_OUT_RMP \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, SPI0_RMP)

/* SPI2_MISO */
#define SPI2_MISO_PB4_INP_NORMP \
	GD32_PINMUX_AFIO('B', 4, GPIO_IN, SPI2_NORMP)
#define SPI2_MISO_PB4_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 4, ALTERNATE, SPI2_NORMP)

/* SPI2_MOSI */
#define SPI2_MOSI_PB5_INP_NORMP \
	GD32_PINMUX_AFIO('B', 5, GPIO_IN, SPI2_NORMP)
#define SPI2_MOSI_PB5_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, SPI2_NORMP)

/* SPI2_NSS */
#define SPI2_NSS_PA15_INP_NORMP \
	GD32_PINMUX_AFIO('A', 15, GPIO_IN, SPI2_NORMP)
#define SPI2_NSS_PA15_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, SPI2_NORMP)
#define SPI2_NSS_PA4_INP_RMP \
	GD32_PINMUX_AFIO('A', 4, GPIO_IN, SPI2_RMP)
#define SPI2_NSS_PA4_OUT_RMP \
	GD32_PINMUX_AFIO('A', 4, ALTERNATE, SPI2_RMP)

