nandojve/hal_gigadevice/include/dt-bindings/pinctrl/gd32e507z(c-e)xx-pinctrl.h
/* SPI2_SCK */
#define SPI2_SCK_PB3_INP_NORMP \
	GD32_PINMUX_AFIO('B', 3, GPIO_IN, SPI2_NORMP)
#define SPI2_SCK_PB3_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, SPI2_NORMP)

/* TIMER0_CH0 */
#define TIMER0_CH0_PA8_INP_NORMP \
	GD32_PINMUX_AFIO('A', 8, GPIO_IN, TIMER0_NORMP)
#define TIMER0_CH0_PA8_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH0_PA8_INP_PRMP \
	GD32_PINMUX_AFIO('A', 8, GPIO_IN, TIMER0_PRMP)
#define TIMER0_CH0_PA8_OUT_PRMP \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, TIMER0_PRMP)
#define TIMER0_CH0_PE9_INP_FRMP \
	GD32_PINMUX_AFIO('E', 9, GPIO_IN, TIMER0_FRMP)
#define TIMER0_CH0_PE9_OUT_FRMP \
	GD32_PINMUX_AFIO('E', 9, ALTERNATE, TIMER0_FRMP)

/* TIMER0_CH0_ON */
#define TIMER0_CH0_ON_PA7_PRMP \
	GD32_PINMUX_AFIO('A', 7, ALTERNATE, TIMER0_PRMP)
#define TIMER0_CH0_ON_PE8_FRMP \
	GD32_PINMUX_AFIO('E', 8, ALTERNATE, TIMER0_FRMP)

/* TIMER0_CH1 */
#define TIMER0_CH1_PA9_INP_NORMP \
	GD32_PINMUX_AFIO('A', 9, GPIO_IN, TIMER0_NORMP)
#define TIMER0_CH1_PA9_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 9, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH1_PA9_INP_PRMP \
	GD32_PINMUX_AFIO('A', 9, GPIO_IN, TIMER0_PRMP)
#define TIMER0_CH1_PA9_OUT_PRMP \
	GD32_PINMUX_AFIO('A', 9, ALTERNATE, TIMER0_PRMP)
#define TIMER0_CH1_PE11_INP_FRMP \
	GD32_PINMUX_AFIO('E', 11, GPIO_IN, TIMER0_FRMP)
#define TIMER0_CH1_PE11_OUT_FRMP \
	GD32_PINMUX_AFIO('E', 11, ALTERNATE, TIMER0_FRMP)

/* TIMER0_CH1_ON */
#define TIMER0_CH1_ON_PB0_PRMP \
	GD32_PINMUX_AFIO('B', 0, ALTERNATE, TIMER0_PRMP)
#define TIMER0_CH1_ON_PE10_FRMP \
	GD32_PINMUX_AFIO('E', 10, ALTERNATE, TIMER0_FRMP)

/* TIMER0_CH2 */
#define TIMER0_CH2_PA10_INP_NORMP \
	GD32_PINMUX_AFIO('A', 10, GPIO_IN, TIMER0_NORMP)
#define TIMER0_CH2_PA10_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 10, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH2_PA10_INP_PRMP \
	GD32_PINMUX_AFIO('A', 10, GPIO_IN, TIMER0_PRMP)
#define TIMER0_CH2_PA10_OUT_PRMP \
	GD32_PINMUX_AFIO('A', 10, ALTERNATE, TIMER0_PRMP)
#define TIMER0_CH2_PE13_INP_FRMP \
	GD32_PINMUX_AFIO('E', 13, GPIO_IN, TIMER0_FRMP)
#define TIMER0_CH2_PE13_OUT_FRMP \
	GD32_PINMUX_AFIO('E', 13, ALTERNATE, TIMER0_FRMP)

/* TIMER0_CH2_ON */
#define TIMER0_CH2_ON_PB1_PRMP \
	GD32_PINMUX_AFIO('B', 1, ALTERNATE, TIMER0_PRMP)
#define TIMER0_CH2_ON_PE12_FRMP \
	GD32_PINMUX_AFIO('E', 12, ALTERNATE, TIMER0_FRMP)

/* TIMER0_CH3 */
#define TIMER0_CH3_PA11_INP_NORMP \
	GD32_PINMUX_AFIO('A', 11, GPIO_IN, TIMER0_NORMP)
#define TIMER0_CH3_PA11_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 11, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH3_PA11_INP_PRMP \
	GD32_PINMUX_AFIO('A', 11, GPIO_IN, TIMER0_PRMP)
#define TIMER0_CH3_PA11_OUT_PRMP \
	GD32_PINMUX_AFIO('A', 11, ALTERNATE, TIMER0_PRMP)
#define TIMER0_CH3_PE14_INP_FRMP \
	GD32_PINMUX_AFIO('E', 14, GPIO_IN, TIMER0_FRMP)
#define TIMER0_CH3_PE14_OUT_FRMP \
	GD32_PINMUX_AFIO('E', 14, ALTERNATE, TIMER0_FRMP)

/* TIMER0_ETI */
#define TIMER0_ETI_PA12_NORMP \
	GD32_PINMUX_AFIO('A', 12, GPIO_IN, TIMER0_NORMP)
#define TIMER0_ETI_PA12_PRMP \
	GD32_PINMUX_AFIO('A', 12, GPIO_IN, TIMER0_PRMP)
#define TIMER0_ETI_PE7_FRMP \
	GD32_PINMUX_AFIO('E', 7, GPIO_IN, TIMER0_FRMP)

/* TIMER10_CH0 */
#define TIMER10_CH0_PF7_INP_RMP \
	GD32_PINMUX_AFIO('F', 7, GPIO_IN, TIMER10_RMP)
#define TIMER10_CH0_PF7_OUT_RMP \
	GD32_PINMUX_AFIO('F', 7, ALTERNATE, TIMER10_RMP)

/* TIMER12_CH0 */
#define TIMER12_CH0_PA6_INP_NORMP \
	GD32_PINMUX_AFIO('A', 6, GPIO_IN, TIMER12_NORMP)
#define TIMER12_CH0_PA6_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 6, ALTERNATE, TIMER12_NORMP)
#define TIMER12_CH0_PF8_INP_RMP \
	GD32_PINMUX_AFIO('F', 8, GPIO_IN, TIMER12_RMP)
#define TIMER12_CH0_PF8_OUT_RMP \
	GD32_PINMUX_AFIO('F', 8, ALTERNATE, TIMER12_RMP)

/* TIMER13_CH0 */
#define TIMER13_CH0_PA7_INP_NORMP \
	GD32_PINMUX_AFIO('A', 7, GPIO_IN, TIMER13_NORMP)
#define TIMER13_CH0_PA7_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 7, ALTERNATE, TIMER13_NORMP)
#define TIMER13_CH0_PF9_INP_RMP \
	GD32_PINMUX_AFIO('F', 9, GPIO_IN, TIMER13_RMP)
#define TIMER13_CH0_PF9_OUT_RMP \
	GD32_PINMUX_AFIO('F', 9, ALTERNATE, TIMER13_RMP)

/* TIMER1_CH0 */
#define TIMER1_CH0_PA0_INP_NORMP \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, TIMER1_NORMP)
#define TIMER1_CH0_PA0_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 0, ALTERNATE, TIMER1_NORMP)
#define TIMER1_CH0_PA0_INP_PRMP2 \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, TIMER1_PRMP2)
#define TIMER1_CH0_PA0_OUT_PRMP2 \
	GD32_PINMUX_AFIO('A', 0, ALTERNATE, TIMER1_PRMP2)
#define TIMER1_CH0_PA15_INP_PRMP1 \
	GD32_PINMUX_AFIO('A', 15, GPIO_IN, TIMER1_PRMP1)
#define TIMER1_CH0_PA15_OUT_PRMP1 \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, TIMER1_PRMP1)
#define TIMER1_CH0_PA15_INP_FRMP \
	GD32_PINMUX_AFIO('A', 15, GPIO_IN, TIMER1_FRMP)
#define TIMER1_CH0_PA15_OUT_FRMP \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, TIMER1_FRMP)

/* TIMER1_CH1 */
#define TIMER1_CH1_PA1_INP_NORMP \
	GD32_PINMUX_AFIO('A', 1, GPIO_IN, TIMER1_NORMP)
#define TIMER1_CH1_PA1_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 1, ALTERNATE, TIMER1_NORMP)
#define TIMER1_CH1_PA1_INP_PRMP2 \
	GD32_PINMUX_AFIO('A', 1, GPIO_IN, TIMER1_PRMP2)
#define TIMER1_CH1_PA1_OUT_PRMP2 \
	GD32_PINMUX_AFIO('A', 1, ALTERNATE, TIMER1_PRMP2)
#define TIMER1_CH1_PB3_INP_PRMP1 \
	GD32_PINMUX_AFIO('B', 3, GPIO_IN, TIMER1_PRMP1)
#define TIMER1_CH1_PB3_OUT_PRMP1 \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, TIMER1_PRMP1)
#define TIMER1_CH1_PB3_INP_FRMP \
	GD32_PINMUX_AFIO('B', 3, GPIO_IN, TIMER1_FRMP)
#define TIMER1_CH1_PB3_OUT_FRMP \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, TIMER1_FRMP)

/* TIMER1_CH2 */
#define TIMER1_CH2_PA2_INP_NORMP \
	GD32_PINMUX_AFIO('A', 2, GPIO_IN, TIMER1_NORMP)
#define TIMER1_CH2_PA2_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, TIMER1_NORMP)
#define TIMER1_CH2_PA2_INP_PRMP1 \
	GD32_PINMUX_AFIO('A', 2, GPIO_IN, TIMER1_PRMP1)
#define TIMER1_CH2_PA2_OUT_PRMP1 \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, TIMER1_PRMP1)

/* TIMER1_CH3 */
#define TIMER1_CH3_PA3_INP_NORMP \
	GD32_PINMUX_AFIO('A', 3, GPIO_IN, TIMER1_NORMP)
#define TIMER1_CH3_PA3_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 3, ALTERNATE, TIMER1_NORMP)
#define TIMER1_CH3_PA3_INP_PRMP1 \
	GD32_PINMUX_AFIO('A', 3, GPIO_IN, TIMER1_PRMP1)
#define TIMER1_CH3_PA3_OUT_PRMP1 \
	GD32_PINMUX_AFIO('A', 3, ALTERNATE, TIMER1_PRMP1)

/* TIMER1_ETI */
#define TIMER1_ETI_PA0_NORMP \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, TIMER1_NORMP)
#define TIMER1_ETI_PA0_PRMP2 \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, TIMER1_PRMP2)
#define TIMER1_ETI_PA15_PRMP1 \
	GD32_PINMUX_AFIO('A', 15, GPIO_IN, TIMER1_PRMP1)
#define TIMER1_ETI_PA15_FRMP \
	GD32_PINMUX_AFIO('A', 15, GPIO_IN, TIMER1_FRMP)

