nandojve/hal_gigadevice/include/dt-bindings/pinctrl/gd32e507z(c-e)xx-pinctrl.h
/* TIMER2_CH0 */
#define TIMER2_CH0_PA6_INP_NORMP \
	GD32_PINMUX_AFIO('A', 6, GPIO_IN, TIMER2_NORMP)
#define TIMER2_CH0_PA6_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 6, ALTERNATE, TIMER2_NORMP)
#define TIMER2_CH0_PB4_INP_PRMP \
	GD32_PINMUX_AFIO('B', 4, GPIO_IN, TIMER2_PRMP)
#define TIMER2_CH0_PB4_OUT_PRMP \
	GD32_PINMUX_AFIO('B', 4, ALTERNATE, TIMER2_PRMP)

/* TIMER2_CH1 */
#define TIMER2_CH1_PA7_INP_NORMP \
	GD32_PINMUX_AFIO('A', 7, GPIO_IN, TIMER2_NORMP)
#define TIMER2_CH1_PA7_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 7, ALTERNATE, TIMER2_NORMP)
#define TIMER2_CH1_PB5_INP_PRMP \
	GD32_PINMUX_AFIO('B', 5, GPIO_IN, TIMER2_PRMP)
#define TIMER2_CH1_PB5_OUT_PRMP \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, TIMER2_PRMP)

/* TIMER2_CH2 */
#define TIMER2_CH2_PB0_INP_NORMP \
	GD32_PINMUX_AFIO('B', 0, GPIO_IN, TIMER2_NORMP)
#define TIMER2_CH2_PB0_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 0, ALTERNATE, TIMER2_NORMP)
#define TIMER2_CH2_PB0_INP_PRMP \
	GD32_PINMUX_AFIO('B', 0, GPIO_IN, TIMER2_PRMP)
#define TIMER2_CH2_PB0_OUT_PRMP \
	GD32_PINMUX_AFIO('B', 0, ALTERNATE, TIMER2_PRMP)

/* TIMER2_CH3 */
#define TIMER2_CH3_PB1_INP_NORMP \
	GD32_PINMUX_AFIO('B', 1, GPIO_IN, TIMER2_NORMP)
#define TIMER2_CH3_PB1_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 1, ALTERNATE, TIMER2_NORMP)
#define TIMER2_CH3_PB1_INP_PRMP \
	GD32_PINMUX_AFIO('B', 1, GPIO_IN, TIMER2_PRMP)
#define TIMER2_CH3_PB1_OUT_PRMP \
	GD32_PINMUX_AFIO('B', 1, ALTERNATE, TIMER2_PRMP)

/* TIMER2_ETI */
#define TIMER2_ETI_PD2 \
	GD32_PINMUX_AFIO('D', 2, GPIO_IN, NORMP)

/* TIMER3_CH0 */
#define TIMER3_CH0_PB6_INP_NORMP \
	GD32_PINMUX_AFIO('B', 6, GPIO_IN, TIMER3_NORMP)
#define TIMER3_CH0_PB6_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, TIMER3_NORMP)
#define TIMER3_CH0_PD12_INP_RMP \
	GD32_PINMUX_AFIO('D', 12, GPIO_IN, TIMER3_RMP)
#define TIMER3_CH0_PD12_OUT_RMP \
	GD32_PINMUX_AFIO('D', 12, ALTERNATE, TIMER3_RMP)

/* TIMER3_CH1 */
#define TIMER3_CH1_PB7_INP_NORMP \
	GD32_PINMUX_AFIO('B', 7, GPIO_IN, TIMER3_NORMP)
#define TIMER3_CH1_PB7_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 7, ALTERNATE, TIMER3_NORMP)
#define TIMER3_CH1_PD13_INP_RMP \
	GD32_PINMUX_AFIO('D', 13, GPIO_IN, TIMER3_RMP)
#define TIMER3_CH1_PD13_OUT_RMP \
	GD32_PINMUX_AFIO('D', 13, ALTERNATE, TIMER3_RMP)

/* TIMER3_CH2 */
#define TIMER3_CH2_PD14_INP_RMP \
	GD32_PINMUX_AFIO('D', 14, GPIO_IN, TIMER3_RMP)
#define TIMER3_CH2_PD14_OUT_RMP \
	GD32_PINMUX_AFIO('D', 14, ALTERNATE, TIMER3_RMP)

/* TIMER3_CH3 */
#define TIMER3_CH3_PD15_INP_RMP \
	GD32_PINMUX_AFIO('D', 15, GPIO_IN, TIMER3_RMP)
#define TIMER3_CH3_PD15_OUT_RMP \
	GD32_PINMUX_AFIO('D', 15, ALTERNATE, TIMER3_RMP)

/* TIMER3_ETI */
#define TIMER3_ETI_PE0 \
	GD32_PINMUX_AFIO('E', 0, GPIO_IN, NORMP)

/* TIMER4_CH0 */
#define TIMER4_CH0_PA0_INP \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, NORMP)
#define TIMER4_CH0_PA0_OUT \
	GD32_PINMUX_AFIO('A', 0, ALTERNATE, NORMP)

/* TIMER4_CH1 */
#define TIMER4_CH1_PA1_INP \
	GD32_PINMUX_AFIO('A', 1, GPIO_IN, NORMP)
#define TIMER4_CH1_PA1_OUT \
	GD32_PINMUX_AFIO('A', 1, ALTERNATE, NORMP)

/* TIMER4_CH2 */
#define TIMER4_CH2_PA2_INP \
	GD32_PINMUX_AFIO('A', 2, GPIO_IN, NORMP)
#define TIMER4_CH2_PA2_OUT \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, NORMP)

/* TIMER4_CH3 */
#define TIMER4_CH3_PA3_INP \
	GD32_PINMUX_AFIO('A', 3, GPIO_IN, NORMP)
#define TIMER4_CH3_PA3_OUT \
	GD32_PINMUX_AFIO('A', 3, ALTERNATE, NORMP)

/* TIMER7_BRKIN */
#define TIMER7_BRKIN_PA6 \
	GD32_PINMUX_AFIO('A', 6, GPIO_IN, NORMP)

/* TIMER7_CH0_ON */
#define TIMER7_CH0_ON_PA7 \
	GD32_PINMUX_AFIO('A', 7, ALTERNATE, NORMP)

/* TIMER7_CH1_ON */
#define TIMER7_CH1_ON_PB0 \
	GD32_PINMUX_AFIO('B', 0, ALTERNATE, NORMP)

/* TIMER7_CH2_ON */
#define TIMER7_CH2_ON_PB1 \
	GD32_PINMUX_AFIO('B', 1, ALTERNATE, NORMP)

/* TIMER7_ETI */
#define TIMER7_ETI_PA0 \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, NORMP)

/* TIMER8_CH0 */
#define TIMER8_CH0_PA2_INP_NORMP \
	GD32_PINMUX_AFIO('A', 2, GPIO_IN, TIMER8_NORMP)
#define TIMER8_CH0_PA2_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, TIMER8_NORMP)
#define TIMER8_CH0_PE5_INP_RMP \
	GD32_PINMUX_AFIO('E', 5, GPIO_IN, TIMER8_RMP)
#define TIMER8_CH0_PE5_OUT_RMP \
	GD32_PINMUX_AFIO('E', 5, ALTERNATE, TIMER8_RMP)

/* TIMER8_CH1 */
#define TIMER8_CH1_PA3_INP_NORMP \
	GD32_PINMUX_AFIO('A', 3, GPIO_IN, TIMER8_NORMP)
#define TIMER8_CH1_PA3_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 3, ALTERNATE, TIMER8_NORMP)
#define TIMER8_CH1_PE6_INP_RMP \
	GD32_PINMUX_AFIO('E', 6, GPIO_IN, TIMER8_RMP)
#define TIMER8_CH1_PE6_OUT_RMP \
	GD32_PINMUX_AFIO('E', 6, ALTERNATE, TIMER8_RMP)

/* TIMER9_CH0 */
#define TIMER9_CH0_PF6_INP_RMP \
	GD32_PINMUX_AFIO('F', 6, GPIO_IN, TIMER9_RMP)
#define TIMER9_CH0_PF6_OUT_RMP \
	GD32_PINMUX_AFIO('F', 6, ALTERNATE, TIMER9_RMP)

/* UART4_RX */
#define UART4_RX_PD2 \
	GD32_PINMUX_AFIO('D', 2, GPIO_IN, NORMP)

/* USART0_CK */
#define USART0_CK_PA8 \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, NORMP)

/* USART0_CTS */
#define USART0_CTS_PA11 \
	GD32_PINMUX_AFIO('A', 11, GPIO_IN, NORMP)

/* USART0_RTS */
#define USART0_RTS_PA12 \
	GD32_PINMUX_AFIO('A', 12, ALTERNATE, NORMP)

/* USART0_RX */
#define USART0_RX_PA10_NORMP \
	GD32_PINMUX_AFIO('A', 10, GPIO_IN, USART0_NORMP)
#define USART0_RX_PB7_RMP \
	GD32_PINMUX_AFIO('B', 7, GPIO_IN, USART0_RMP)

/* USART0_TX */
#define USART0_TX_PA9_NORMP \
	GD32_PINMUX_AFIO('A', 9, ALTERNATE, USART0_NORMP)
#define USART0_TX_PB6_RMP \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, USART0_RMP)

/* USART1_CK */
#define USART1_CK_PA4_NORMP \
	GD32_PINMUX_AFIO('A', 4, ALTERNATE, USART1_NORMP)
#define USART1_CK_PD7_RMP \
	GD32_PINMUX_AFIO('D', 7, ALTERNATE, USART1_RMP)

/* USART1_CTS */
#define USART1_CTS_PA0_NORMP \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, USART1_NORMP)
#define USART1_CTS_PD3_RMP \
	GD32_PINMUX_AFIO('D', 3, GPIO_IN, USART1_RMP)

/* USART1_RTS */
#define USART1_RTS_PA1_NORMP \
	GD32_PINMUX_AFIO('A', 1, ALTERNATE, USART1_NORMP)
#define USART1_RTS_PD4_RMP \
	GD32_PINMUX_AFIO('D', 4, ALTERNATE, USART1_RMP)

/* USART1_RX */
#define USART1_RX_PA3_NORMP \
	GD32_PINMUX_AFIO('A', 3, GPIO_IN, USART1_NORMP)
#define USART1_RX_PD6_RMP \
	GD32_PINMUX_AFIO('D', 6, GPIO_IN, USART1_RMP)

/* USART1_TX */
#define USART1_TX_PA2_NORMP \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, USART1_NORMP)
#define USART1_TX_PD5_RMP \
	GD32_PINMUX_AFIO('D', 5, ALTERNATE, USART1_RMP)

