nandojve/hal_gigadevice/include/dt-bindings/pinctrl/gd32e507z(c-e)xx-pinctrl.h
/* USART2_CK */
#define USART2_CK_PD10_FRMP \
	GD32_PINMUX_AFIO('D', 10, ALTERNATE, USART2_FRMP)

/* USART2_CTS */
#define USART2_CTS_PD11_FRMP \
	GD32_PINMUX_AFIO('D', 11, GPIO_IN, USART2_FRMP)

/* USART2_RTS */
#define USART2_RTS_PD12_FRMP \
	GD32_PINMUX_AFIO('D', 12, ALTERNATE, USART2_FRMP)

/* USART2_RX */
#define USART2_RX_PD9_FRMP \
	GD32_PINMUX_AFIO('D', 9, GPIO_IN, USART2_FRMP)

/* USART2_TX */
#define USART2_TX_PD8_FRMP \
	GD32_PINMUX_AFIO('D', 8, ALTERNATE, USART2_FRMP)

/* USBHS_DM */
#define USBHS_DM_PA11_INP \
	GD32_PINMUX_AFIO('A', 11, GPIO_IN, NORMP)
#define USBHS_DM_PA11_OUT \
	GD32_PINMUX_AFIO('A', 11, ALTERNATE, NORMP)

/* USBHS_DP */
#define USBHS_DP_PA12_INP \
	GD32_PINMUX_AFIO('A', 12, GPIO_IN, NORMP)
#define USBHS_DP_PA12_OUT \
	GD32_PINMUX_AFIO('A', 12, ALTERNATE, NORMP)

/* USBHS_ID */
#define USBHS_ID_PA10_INP \
	GD32_PINMUX_AFIO('A', 10, GPIO_IN, NORMP)
#define USBHS_ID_PA10_OUT \
	GD32_PINMUX_AFIO('A', 10, ALTERNATE, NORMP)

/* USBHS_SOF */
#define USBHS_SOF_PA8 \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, NORMP)

/* USBHS_ULPI_D1 */
#define USBHS_ULPI_D1_PB0_INP \
	GD32_PINMUX_AFIO('B', 0, GPIO_IN, NORMP)
#define USBHS_ULPI_D1_PB0_OUT \
	GD32_PINMUX_AFIO('B', 0, ALTERNATE, NORMP)

/* USBHS_ULPI_D2 */
#define USBHS_ULPI_D2_PB1_INP \
	GD32_PINMUX_AFIO('B', 1, GPIO_IN, NORMP)
#define USBHS_ULPI_D2_PB1_OUT \
	GD32_PINMUX_AFIO('B', 1, ALTERNATE, NORMP)

/* USBHS_ULPI_D4 */
#define USBHS_ULPI_D4_PB2_INP \
	GD32_PINMUX_AFIO('B', 2, GPIO_IN, NORMP)
#define USBHS_ULPI_D4_PB2_OUT \
	GD32_PINMUX_AFIO('B', 2, ALTERNATE, NORMP)

/* USBHS_ULPI_D7 */
#define USBHS_ULPI_D7_PB5_INP \
	GD32_PINMUX_AFIO('B', 5, GPIO_IN, NORMP)
#define USBHS_ULPI_D7_PB5_OUT \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, NORMP)

/* USBHS_VBUS */
#define USBHS_VBUS_PA9 \
	GD32_PINMUX_AFIO('A', 9, GPIO_IN, NORMP)

/* WKUP0 */
#define WKUP0_PA0 \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, NORMP)

/* WKUP2 */
#define WKUP2_PE6 \
	GD32_PINMUX_AFIO('E', 6, GPIO_IN, NORMP)

/* WKUP3 */
#define WKUP3_PA2 \
	GD32_PINMUX_AFIO('A', 2, GPIO_IN, NORMP)

/* WKUP5 */
#define WKUP5_PB5 \
	GD32_PINMUX_AFIO('B', 5, GPIO_IN, NORMP)

/* WKUP7 */
#define WKUP7_PF8 \
	GD32_PINMUX_AFIO('F', 8, GPIO_IN, NORMP)
